[
  {
    "name": "Research Reflaxe MarkUnusedVariablesImpl Integration",
    "description": "Investigate whether we can/should use Reflaxe's built-in MarkUnusedVariablesImpl preprocessor instead of our custom HygieneTransforms usage analysis. The reference implementations show Reflaxe has comprehensive variable handling infrastructure that we may not be leveraging properly.",
    "implementationGuide": "INVESTIGATION TASKS: 1. Read MarkUnusedVariablesImpl.hx from reference directory at /Users/fullofcaffeine/workspace/code/haxe.elixir.reference/reflaxe/src/reflaxe/preprocessors/implementations/MarkUnusedVariablesImpl.hx - Understand how it marks variables with -reflaxe.unused metadata - Check if it handles pattern-bound variables correctly. 2. Check Our Preprocessor Usage: Search ElixirCompiler.hx for preprocessor initialization, see which Reflaxe preprocessors we're currently using, determine if we're enabling MarkUnusedVariablesImpl. 3. Compare approaches between current custom HygieneTransforms.usageAnalysisPass and Reflaxe's MarkUnusedVariablesImpl. 4. Make recommendation: If MarkUnusedVariablesImpl handles pattern variables correctly then use it, otherwise document why and proceed with HygieneTransforms fix. SUCCESS CRITERIA: Clear decision on using Reflaxe preprocessor OR custom HygieneTransforms with justification documented.",
    "notes": "This is CRITICAL research before implementing fixes. Using established Reflaxe infrastructure is always better than reinventing.",
    "dependencies": [],
    "relatedFiles": [
      {
        "path": "/Users/fullofcaffeine/workspace/code/haxe.elixir.reference/reflaxe/src/reflaxe/preprocessors/implementations/MarkUnusedVariablesImpl.hx",
        "type": "REFERENCE",
        "description": "Reflaxe built-in unused variable detection"
      },
      {
        "path": "/Users/fullofcaffeine/workspace/code/haxe.elixir/src/reflaxe/elixir/ElixirCompiler.hx",
        "type": "TO_MODIFY",
        "description": "Check preprocessor initialization"
      }
    ],
    "verificationCriteria": "Research complete with clear architectural decision documented"
  }
]
